// Вспомогательная функция, которая выбрасывает ошибку и возвращает тип never
// Это говорит TypeScript: "После этого вызова код не выполняется, не ссы"
const throwError = (msg: string): never => {
  throw new Error(msg);
};

// Таблица процентов ПМ
const rpeTable: Record<number, Record<string, number>> = {
  1:  { '6': 0.86, '6.5': 0.88, '7': 0.90, '7.5': 0.91, '8': 0.92, '8.5': 0.93, '9': 0.94, '9.5': 0.95, '10': 0.96 },
  2:  { '6': 0.84, '6.5': 0.86, '7': 0.88, '7.5': 0.89, '8': 0.90, '8.5': 0.91, '9': 0.92, '9.5': 0.93, '10': 0.94 },
  3:  { '6': 0.82, '6.5': 0.84, '7': 0.86, '7.5': 0.87, '8': 0.88, '8.5': 0.89, '9': 0.90, '9.5': 0.91, '10': 0.92 },
  4:  { '6': 0.80, '6.5': 0.82, '7': 0.84, '7.5': 0.85, '8': 0.86, '8.5': 0.87, '9': 0.88, '9.5': 0.89, '10': 0.90 },
  5:  { '6': 0.78, '6.5': 0.80, '7': 0.82, '7.5': 0.83, '8': 0.84, '8.5': 0.85, '9': 0.86, '9.5': 0.87, '10': 0.88 },
  6:  { '6': 0.76, '6.5': 0.78, '7': 0.80, '7.5': 0.81, '8': 0.82, '8.5': 0.83, '9': 0.84, '9.5': 0.85, '10': 0.86 },
  7:  { '6': 0.74, '6.5': 0.76, '7': 0.78, '7.5': 0.79, '8': 0.80, '8.5': 0.81, '9': 0.82, '9.5': 0.83, '10': 0.84 },
  8:  { '6': 0.72, '6.5': 0.74, '7': 0.76, '7.5': 0.77, '8': 0.78, '8.5': 0.79, '9': 0.80, '9.5': 0.81, '10': 0.82 },
  9:  { '6': 0.70, '6.5': 0.72, '7': 0.74, '7.5': 0.75, '8': 0.76, '8.5': 0.77, '9': 0.78, '9.5': 0.79, '10': 0.80 },
  10: { '6': 0.68, '6.5': 0.70, '7': 0.72, '7.5': 0.73, '8': 0.74, '8.5': 0.75, '9': 0.76, '9.5': 0.77, '10': 0.78 },
  11: { '6': 0.66, '6.5': 0.68, '7': 0.70, '7.5': 0.71, '8': 0.72, '8.5': 0.73, '9': 0.74, '9.5': 0.75, '10': 0.76 },
  12: { '6': 0.64, '6.5': 0.66, '7': 0.68, '7.5': 0.69, '8': 0.70, '8.5': 0.71, '9': 0.72, '9.5': 0.73, '10': 0.74 },
};

export const getPercentPM = (reps: number, rpe: number): number => {
  const rpeKey = rpe % 1 === 0 ? rpe.toString() : rpe.toFixed(1);
  const row = rpeTable[reps];
  if (!row) return throwError('Нет данных для повторений ${reps}');
  const percent = row[rpeKey];
  if (percent === undefined) return throwError('Нет данных для RPE ${rpeKey} на ${reps} повторениях');
  return percent;
};

export const calculatePDM = (weight: number, reps: number, rpe: number): number => {
  const percent = getPercentPM(reps, rpe);
  return Math.round(weight /  percent);
};